## OpenTofu Plan

**Environment:** `dev`
**Directory:** `./02-azure/03-platform-connectivity/environments/dev-gwc`

<details>
<summary>Show Plan Output</summary>

```hcl
Acquiring state lock. This may take a few moments...
data.terraform_remote_state.management: Reading...
data.terraform_remote_state.management: Read complete after 2s

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # module.hub.azurerm_network_security_group.this["ApiManagementSubnet"] will be created
  + resource "azurerm_network_security_group" "this" {
      + id                  = (known after apply)
      + location            = "germanywestcentral"
      + name                = "nsg-ApiManagementSubnet"
      + resource_group_name = "rg-connectivity-on-dev-gwc-01"
      + security_rule       = [
          + {
              + access                                     = "Deny"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "DenyAllInbound"
              + priority                                   = 4096
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Deny"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Outbound"
              + name                                       = "DenyAllOutbound"
              + priority                                   = 4096
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "environment" = "dev"
          + "layer"       = "platform-connectivity"
          + "location"    = "germanywestcentral"
          + "managed_by"  = "opentofu"
          + "project"     = "levendaal"
        }
    }

  # module.hub.azurerm_network_security_group.this["ApplicationGatewaySubnet"] will be created
  + resource "azurerm_network_security_group" "this" {
      + id                  = (known after apply)
      + location            = "germanywestcentral"
      + name                = "nsg-ApplicationGatewaySubnet"
      + resource_group_name = "rg-connectivity-on-dev-gwc-01"
      + security_rule       = [
          + {
              + access                                     = "Deny"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "DenyAllInbound"
              + priority                                   = 4096
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Deny"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Outbound"
              + name                                       = "DenyAllOutbound"
              + priority                                   = 4096
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "environment" = "dev"
          + "layer"       = "platform-connectivity"
          + "location"    = "germanywestcentral"
          + "managed_by"  = "opentofu"
          + "project"     = "levendaal"
        }
    }

  # module.hub.azurerm_network_security_group.this["snet-dns-inbound-co-dev-gwc-01"] will be created
  + resource "azurerm_network_security_group" "this" {
      + id                  = (known after apply)
      + location            = "germanywestcentral"
      + name                = "nsg-snet-dns-inbound-co-dev-gwc-01"
      + resource_group_name = "rg-connectivity-on-dev-gwc-01"
      + security_rule       = [
          + {
              + access                                     = "Deny"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "DenyAllInbound"
              + priority                                   = 4096
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Deny"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Outbound"
              + name                                       = "DenyAllOutbound"
              + priority                                   = 4096
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "environment" = "dev"
          + "layer"       = "platform-connectivity"
          + "location"    = "germanywestcentral"
          + "managed_by"  = "opentofu"
          + "project"     = "levendaal"
        }
    }

  # module.hub.azurerm_network_security_group.this["snet-dns-outbound-co-dev-gwc-01"] will be created
  + resource "azurerm_network_security_group" "this" {
      + id                  = (known after apply)
      + location            = "germanywestcentral"
      + name                = "nsg-snet-dns-outbound-co-dev-gwc-01"
      + resource_group_name = "rg-connectivity-on-dev-gwc-01"
      + security_rule       = [
          + {
              + access                                     = "Deny"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "DenyAllInbound"
              + priority                                   = 4096
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Deny"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Outbound"
              + name                                       = "DenyAllOutbound"
              + priority                                   = 4096
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "environment" = "dev"
          + "layer"       = "platform-connectivity"
          + "location"    = "germanywestcentral"
          + "managed_by"  = "opentofu"
          + "project"     = "levendaal"
        }
    }

  # module.hub.azurerm_network_security_group.this["snet-management-co-dev-gwc-01"] will be created
  + resource "azurerm_network_security_group" "this" {
      + id                  = (known after apply)
      + location            = "germanywestcentral"
      + name                = "nsg-snet-management-co-dev-gwc-01"
      + resource_group_name = "rg-connectivity-on-dev-gwc-01"
      + security_rule       = [
          + {
              + access                                     = "Deny"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "DenyAllInbound"
              + priority                                   = 4096
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Deny"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Outbound"
              + name                                       = "DenyAllOutbound"
              + priority                                   = 4096
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "environment" = "dev"
          + "layer"       = "platform-connectivity"
          + "location"    = "germanywestcentral"
          + "managed_by"  = "opentofu"
          + "project"     = "levendaal"
        }
    }

  # module.hub.azurerm_network_security_group.this["snet-nva-co-dev-gwc-01"] will be created
  + resource "azurerm_network_security_group" "this" {
      + id                  = (known after apply)
      + location            = "germanywestcentral"
      + name                = "nsg-snet-nva-co-dev-gwc-01"
      + resource_group_name = "rg-connectivity-on-dev-gwc-01"
      + security_rule       = [
          + {
              + access                                     = "Deny"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "DenyAllInbound"
              + priority                                   = 4096
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Deny"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Outbound"
              + name                                       = "DenyAllOutbound"
              + priority                                   = 4096
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "environment" = "dev"
          + "layer"       = "platform-connectivity"
          + "location"    = "germanywestcentral"
          + "managed_by"  = "opentofu"
          + "project"     = "levendaal"
        }
    }

  # module.hub.azurerm_network_security_group.this["snet-private-endpoints-co-dev-gwc-01"] will be created
  + resource "azurerm_network_security_group" "this" {
      + id                  = (known after apply)
      + location            = "germanywestcentral"
      + name                = "nsg-snet-private-endpoints-co-dev-gwc-01"
      + resource_group_name = "rg-connectivity-on-dev-gwc-01"
      + security_rule       = [
          + {
              + access                                     = "Deny"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "DenyAllInbound"
              + priority                                   = 4096
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Deny"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Outbound"
              + name                                       = "DenyAllOutbound"
              + priority                                   = 4096
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "environment" = "dev"
          + "layer"       = "platform-connectivity"
          + "location"    = "germanywestcentral"
          + "managed_by"  = "opentofu"
          + "project"     = "levendaal"
        }
    }

  # module.hub.azurerm_network_security_group.this["snet-shared-services-co-dev-gwc-01"] will be created
  + resource "azurerm_network_security_group" "this" {
      + id                  = (known after apply)
      + location            = "germanywestcentral"
      + name                = "nsg-snet-shared-services-co-dev-gwc-01"
      + resource_group_name = "rg-connectivity-on-dev-gwc-01"
      + security_rule       = [
          + {
              + access                                     = "Deny"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "DenyAllInbound"
              + priority                                   = 4096
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Deny"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Outbound"
              + name                                       = "DenyAllOutbound"
              + priority                                   = 4096
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "environment" = "dev"
          + "layer"       = "platform-connectivity"
          + "location"    = "germanywestcentral"
          + "managed_by"  = "opentofu"
          + "project"     = "levendaal"
        }
    }

  # module.hub.azurerm_resource_group.this will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "germanywestcentral"
      + name     = "rg-connectivity-on-dev-gwc-01"
      + tags     = {
          + "environment" = "dev"
          + "layer"       = "platform-connectivity"
          + "location"    = "germanywestcentral"
          + "managed_by"  = "opentofu"
          + "project"     = "levendaal"
        }
    }

  # module.hub.azurerm_route_table.this["ApiManagementSubnet"] will be created
  + resource "azurerm_route_table" "this" {
      + bgp_route_propagation_enabled = false
      + id                            = (known after apply)
      + location                      = "germanywestcentral"
      + name                          = "rt-ApiManagementSubnet"
      + resource_group_name           = "rg-connectivity-on-dev-gwc-01"
      + route                         = (known after apply)
      + subnets                       = (known after apply)
      + tags                          = {
          + "environment" = "dev"
          + "layer"       = "platform-connectivity"
          + "location"    = "germanywestcentral"
          + "managed_by"  = "opentofu"
          + "project"     = "levendaal"
        }
    }

  # module.hub.azurerm_route_table.this["ApplicationGatewaySubnet"] will be created
  + resource "azurerm_route_table" "this" {
      + bgp_route_propagation_enabled = false
      + id                            = (known after apply)
      + location                      = "germanywestcentral"
      + name                          = "rt-ApplicationGatewaySubnet"
      + resource_group_name           = "rg-connectivity-on-dev-gwc-01"
      + route                         = (known after apply)
      + subnets                       = (known after apply)
      + tags                          = {
          + "environment" = "dev"
          + "layer"       = "platform-connectivity"
          + "location"    = "germanywestcentral"
          + "managed_by"  = "opentofu"
          + "project"     = "levendaal"
        }
    }

  # module.hub.azurerm_route_table.this["snet-dns-inbound-co-dev-gwc-01"] will be created
  + resource "azurerm_route_table" "this" {
      + bgp_route_propagation_enabled = false
      + id                            = (known after apply)
      + location                      = "germanywestcentral"
      + name                          = "rt-snet-dns-inbound-co-dev-gwc-01"
      + resource_group_name           = "rg-connectivity-on-dev-gwc-01"
      + route                         = (known after apply)
      + subnets                       = (known after apply)
      + tags                          = {
          + "environment" = "dev"
          + "layer"       = "platform-connectivity"
          + "location"    = "germanywestcentral"
          + "managed_by"  = "opentofu"
          + "project"     = "levendaal"
        }
    }

  # module.hub.azurerm_route_table.this["snet-dns-outbound-co-dev-gwc-01"] will be created
  + resource "azurerm_route_table" "this" {
      + bgp_route_propagation_enabled = false
      + id                            = (known after apply)
      + location                      = "germanywestcentral"
      + name                          = "rt-snet-dns-outbound-co-dev-gwc-01"
      + resource_group_name           = "rg-connectivity-on-dev-gwc-01"
      + route                         = (known after apply)
      + subnets                       = (known after apply)
      + tags                          = {
          + "environment" = "dev"
          + "layer"       = "platform-connectivity"
          + "location"    = "germanywestcentral"
          + "managed_by"  = "opentofu"
          + "project"     = "levendaal"
        }
    }

  # module.hub.azurerm_route_table.this["snet-management-co-dev-gwc-01"] will be created
  + resource "azurerm_route_table" "this" {
      + bgp_route_propagation_enabled = false
      + id                            = (known after apply)
      + location                      = "germanywestcentral"
      + name                          = "rt-snet-management-co-dev-gwc-01"
      + resource_group_name           = "rg-connectivity-on-dev-gwc-01"
      + route                         = (known after apply)
      + subnets                       = (known after apply)
      + tags                          = {
          + "environment" = "dev"
          + "layer"       = "platform-connectivity"
          + "location"    = "germanywestcentral"
          + "managed_by"  = "opentofu"
          + "project"     = "levendaal"
        }
    }

  # module.hub.azurerm_route_table.this["snet-nva-co-dev-gwc-01"] will be created
  + resource "azurerm_route_table" "this" {
      + bgp_route_propagation_enabled = false
      + id                            = (known after apply)
      + location                      = "germanywestcentral"
      + name                          = "rt-snet-nva-co-dev-gwc-01"
      + resource_group_name           = "rg-connectivity-on-dev-gwc-01"
      + route                         = (known after apply)
      + subnets                       = (known after apply)
      + tags                          = {
          + "environment" = "dev"
          + "layer"       = "platform-connectivity"
          + "location"    = "germanywestcentral"
          + "managed_by"  = "opentofu"
          + "project"     = "levendaal"
        }
    }

  # module.hub.azurerm_route_table.this["snet-private-endpoints-co-dev-gwc-01"] will be created
  + resource "azurerm_route_table" "this" {
      + bgp_route_propagation_enabled = false
      + id                            = (known after apply)
      + location                      = "germanywestcentral"
      + name                          = "rt-snet-private-endpoints-co-dev-gwc-01"
      + resource_group_name           = "rg-connectivity-on-dev-gwc-01"
      + route                         = (known after apply)
      + subnets                       = (known after apply)
      + tags                          = {
          + "environment" = "dev"
          + "layer"       = "platform-connectivity"
          + "location"    = "germanywestcentral"
          + "managed_by"  = "opentofu"
          + "project"     = "levendaal"
        }
    }

  # module.hub.azurerm_route_table.this["snet-shared-services-co-dev-gwc-01"] will be created
  + resource "azurerm_route_table" "this" {
      + bgp_route_propagation_enabled = false
      + id                            = (known after apply)
      + location                      = "germanywestcentral"
      + name                          = "rt-snet-shared-services-co-dev-gwc-01"
      + resource_group_name           = "rg-connectivity-on-dev-gwc-01"
      + route                         = (known after apply)
      + subnets                       = (known after apply)
      + tags                          = {
          + "environment" = "dev"
          + "layer"       = "platform-connectivity"
          + "location"    = "germanywestcentral"
          + "managed_by"  = "opentofu"
          + "project"     = "levendaal"
        }
    }

  # module.hub.azurerm_subnet.azure["AzureBastionSubnet"] will be created
  + resource "azurerm_subnet" "azure" {
      + address_prefixes                              = [
          + "10.2.0.128/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "AzureBastionSubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-connectivity-on-dev-gwc-01"
      + virtual_network_name                          = "vnet-hub-co-dev-gwc-01"
    }

  # module.hub.azurerm_subnet.azure["AzureFirewallManagement"] will be created
  + resource "azurerm_subnet" "azure" {
      + address_prefixes                              = [
          + "10.2.1.0/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "AzureFirewallManagement"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-connectivity-on-dev-gwc-01"
      + virtual_network_name                          = "vnet-hub-co-dev-gwc-01"
    }

  # module.hub.azurerm_subnet.azure["AzureFirewallSubnet"] will be created
  + resource "azurerm_subnet" "azure" {
      + address_prefixes                              = [
          + "10.2.0.64/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "AzureFirewallSubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-connectivity-on-dev-gwc-01"
      + virtual_network_name                          = "vnet-hub-co-dev-gwc-01"
    }

  # module.hub.azurerm_subnet.azure["GatewaySubnet"] will be created
  + resource "azurerm_subnet" "azure" {
      + address_prefixes                              = [
          + "10.2.0.0/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "GatewaySubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-connectivity-on-dev-gwc-01"
      + virtual_network_name                          = "vnet-hub-co-dev-gwc-01"
    }

  # module.hub.azurerm_subnet.azure["RouteServerSubnet"] will be created
  + resource "azurerm_subnet" "azure" {
      + address_prefixes                              = [
          + "10.2.0.192/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "RouteServerSubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-connectivity-on-dev-gwc-01"
      + virtual_network_name                          = "vnet-hub-co-dev-gwc-01"
    }

  # module.hub.azurerm_subnet.managed["ApiManagementSubnet"] will be created
  + resource "azurerm_subnet" "managed" {
      + address_prefixes                              = [
          + "10.2.1.128/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "ApiManagementSubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-connectivity-on-dev-gwc-01"
      + virtual_network_name                          = "vnet-hub-co-dev-gwc-01"
    }

  # module.hub.azurerm_subnet.managed["ApplicationGatewaySubnet"] will be created
  + resource "azurerm_subnet" "managed" {
      + address_prefixes                              = [
          + "10.2.1.64/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "ApplicationGatewaySubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-connectivity-on-dev-gwc-01"
      + virtual_network_name                          = "vnet-hub-co-dev-gwc-01"
    }

  # module.hub.azurerm_subnet.managed["snet-dns-inbound-co-dev-gwc-01"] will be created
  + resource "azurerm_subnet" "managed" {
      + address_prefixes                              = [
          + "10.2.1.224/27",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "snet-dns-inbound-co-dev-gwc-01"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-connectivity-on-dev-gwc-01"
      + virtual_network_name                          = "vnet-hub-co-dev-gwc-01"
    }

  # module.hub.azurerm_subnet.managed["snet-dns-outbound-co-dev-gwc-01"] will be created
  + resource "azurerm_subnet" "managed" {
      + address_prefixes                              = [
          + "10.2.2.0/27",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "snet-dns-outbound-co-dev-gwc-01"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-connectivity-on-dev-gwc-01"
      + virtual_network_name                          = "vnet-hub-co-dev-gwc-01"
    }

  # module.hub.azurerm_subnet.managed["snet-management-co-dev-gwc-01"] will be created
  + resource "azurerm_subnet" "managed" {
      + address_prefixes                              = [
          + "10.2.2.32/27",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "snet-management-co-dev-gwc-01"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-connectivity-on-dev-gwc-01"
      + virtual_network_name                          = "vnet-hub-co-dev-gwc-01"
    }

  # module.hub.azurerm_subnet.managed["snet-nva-co-dev-gwc-01"] will be created
  + resource "azurerm_subnet" "managed" {
      + address_prefixes                              = [
          + "10.2.1.192/27",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "snet-nva-co-dev-gwc-01"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-connectivity-on-dev-gwc-01"
      + virtual_network_name                          = "vnet-hub-co-dev-gwc-01"
    }

  # module.hub.azurerm_subnet.managed["snet-private-endpoints-co-dev-gwc-01"] will be created
  + resource "azurerm_subnet" "managed" {
      + address_prefixes                              = [
          + "10.2.2.64/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "snet-private-endpoints-co-dev-gwc-01"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-connectivity-on-dev-gwc-01"
      + virtual_network_name                          = "vnet-hub-co-dev-gwc-01"
    }

  # module.hub.azurerm_subnet.managed["snet-shared-services-co-dev-gwc-01"] will be created
  + resource "azurerm_subnet" "managed" {
      + address_prefixes                              = [
          + "10.2.2.128/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "snet-shared-services-co-dev-gwc-01"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-connectivity-on-dev-gwc-01"
      + virtual_network_name                          = "vnet-hub-co-dev-gwc-01"
    }

  # module.hub.azurerm_subnet_network_security_group_association.this["ApiManagementSubnet"] will be created
  + resource "azurerm_subnet_network_security_group_association" "this" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.hub.azurerm_subnet_network_security_group_association.this["ApplicationGatewaySubnet"] will be created
  + resource "azurerm_subnet_network_security_group_association" "this" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.hub.azurerm_subnet_network_security_group_association.this["snet-dns-inbound-co-dev-gwc-01"] will be created
  + resource "azurerm_subnet_network_security_group_association" "this" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.hub.azurerm_subnet_network_security_group_association.this["snet-dns-outbound-co-dev-gwc-01"] will be created
  + resource "azurerm_subnet_network_security_group_association" "this" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.hub.azurerm_subnet_network_security_group_association.this["snet-management-co-dev-gwc-01"] will be created
  + resource "azurerm_subnet_network_security_group_association" "this" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.hub.azurerm_subnet_network_security_group_association.this["snet-nva-co-dev-gwc-01"] will be created
  + resource "azurerm_subnet_network_security_group_association" "this" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.hub.azurerm_subnet_network_security_group_association.this["snet-private-endpoints-co-dev-gwc-01"] will be created
  + resource "azurerm_subnet_network_security_group_association" "this" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.hub.azurerm_subnet_network_security_group_association.this["snet-shared-services-co-dev-gwc-01"] will be created
  + resource "azurerm_subnet_network_security_group_association" "this" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.hub.azurerm_subnet_route_table_association.this["ApiManagementSubnet"] will be created
  + resource "azurerm_subnet_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.hub.azurerm_subnet_route_table_association.this["ApplicationGatewaySubnet"] will be created
  + resource "azurerm_subnet_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.hub.azurerm_subnet_route_table_association.this["snet-dns-inbound-co-dev-gwc-01"] will be created
  + resource "azurerm_subnet_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.hub.azurerm_subnet_route_table_association.this["snet-dns-outbound-co-dev-gwc-01"] will be created
  + resource "azurerm_subnet_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.hub.azurerm_subnet_route_table_association.this["snet-management-co-dev-gwc-01"] will be created
  + resource "azurerm_subnet_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.hub.azurerm_subnet_route_table_association.this["snet-nva-co-dev-gwc-01"] will be created
  + resource "azurerm_subnet_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.hub.azurerm_subnet_route_table_association.this["snet-private-endpoints-co-dev-gwc-01"] will be created
  + resource "azurerm_subnet_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.hub.azurerm_subnet_route_table_association.this["snet-shared-services-co-dev-gwc-01"] will be created
  + resource "azurerm_subnet_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.hub.azurerm_virtual_network.this will be created
  + resource "azurerm_virtual_network" "this" {
      + address_space                  = [
          + "10.2.0.0/20",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "germanywestcentral"
      + name                           = "vnet-hub-co-dev-gwc-01"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "rg-connectivity-on-dev-gwc-01"
      + subnet                         = (known after apply)
      + tags                           = {
          + "environment" = "dev"
          + "layer"       = "platform-connectivity"
          + "location"    = "germanywestcentral"
          + "managed_by"  = "opentofu"
          + "project"     = "levendaal"
        }
    }

Plan: 47 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + hub = {
      + address_space       = [
          + "10.2.0.0/20",
        ]
      + id                  = (known after apply)
      + name                = "vnet-hub-co-dev-gwc-01"
      + resource_group_name = "rg-connectivity-on-dev-gwc-01"
      + subnets             = {
          + ApiManagementSubnet                  = {
              + address_prefixes = [
                  + "10.2.1.128/26",
                ]
              + id               = (known after apply)
              + name             = "ApiManagementSubnet"
            }
          + ApplicationGatewaySubnet             = {
              + address_prefixes = [
                  + "10.2.1.64/26",
                ]
              + id               = (known after apply)
              + name             = "ApplicationGatewaySubnet"
            }
          + AzureBastionSubnet                   = {
              + address_prefixes = [
                  + "10.2.0.128/26",
                ]
              + id               = (known after apply)
              + name             = "AzureBastionSubnet"
            }
          + AzureFirewallManagement              = {
              + address_prefixes = [
                  + "10.2.1.0/26",
                ]
              + id               = (known after apply)
              + name             = "AzureFirewallManagement"
            }
          + AzureFirewallSubnet                  = {
              + address_prefixes = [
                  + "10.2.0.64/26",
                ]
              + id               = (known after apply)
              + name             = "AzureFirewallSubnet"
            }
          + GatewaySubnet                        = {
              + address_prefixes = [
                  + "10.2.0.0/26",
                ]
              + id               = (known after apply)
              + name             = "GatewaySubnet"
            }
          + RouteServerSubnet                    = {
              + address_prefixes = [
                  + "10.2.0.192/26",
                ]
              + id               = (known after apply)
              + name             = "RouteServerSubnet"
            }
          + snet-dns-inbound-co-dev-gwc-01       = {
              + address_prefixes = [
                  + "10.2.1.224/27",
                ]
              + id               = (known after apply)
              + name             = "snet-dns-inbound-co-dev-gwc-01"
            }
          + snet-dns-outbound-co-dev-gwc-01      = {
              + address_prefixes = [
                  + "10.2.2.0/27",
                ]
              + id               = (known after apply)
              + name             = "snet-dns-outbound-co-dev-gwc-01"
            }
          + snet-management-co-dev-gwc-01        = {
              + address_prefixes = [
                  + "10.2.2.32/27",
                ]
              + id               = (known after apply)
              + name             = "snet-management-co-dev-gwc-01"
            }
          + snet-nva-co-dev-gwc-01               = {
              + address_prefixes = [
                  + "10.2.1.192/27",
                ]
              + id               = (known after apply)
              + name             = "snet-nva-co-dev-gwc-01"
            }
          + snet-private-endpoints-co-dev-gwc-01 = {
              + address_prefixes = [
                  + "10.2.2.64/26",
                ]
              + id               = (known after apply)
              + name             = "snet-private-endpoints-co-dev-gwc-01"
            }
          + snet-shared-services-co-dev-gwc-01   = {
              + address_prefixes = [
                  + "10.2.2.128/26",
                ]
              + id               = (known after apply)
              + name             = "snet-shared-services-co-dev-gwc-01"
            }
        }
    }

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/_temp/pl-connectivity-dev-gwc-tfplan

To perform exactly these actions, run the following command to apply:
    tofu apply "/home/runner/work/_temp/pl-connectivity-dev-gwc-tfplan"
Releasing state lock. This may take a few moments...
```

</details>

*Triggered by @KrijnvanderBurg in commit 3d0e2ba0a35b1bcedceab02a0cdb2321a4672936*